Repository: m7mdra/justcost
Catalog: lib/i10n/intl_*.arb
Languages: ar

source: try again or contact support.
ar: حاول مجددا او قم بالتواصل مع الدعم الفني

source: Try again
ar: حاول مجددا

source: For you
ar: خصيصا لك

source: Post Ad
ar: اضف اعلان

source: Your Location
ar: الموقع الحالي

# loginLoadingMessage
source: Please wait while trying to login.
ar: الرجاء الانتظار بينما يتم تسجيل دخولك

source: Please wait while to submit your ad
ar: الرجاء الانتظار بينما يتم اضافة اعلان جديد

source: Failed to create account, try again
ar: لقد فشلت عملية انشاء حساب.حاول مجددا

source: Failed to verify your account, failed
ar: لقد فشلت عملية التحقق من الحساب, حاول مجددا

source: No Internet Connection
ar: لا يوجد اتصال انترنت

source: No Active internet connection found, check your connection or tap on Try again
ar: لا يوجد اتصال انترنت نشط, قم بتغيير الشبكة الحالية او حاول مجددا

source: Please wait while to submit your products
ar: الرجاء الانتظار بينما يتم اضافة الاعلانات

source: Logout
ar: تسجيل خروج

source: Continue
ar: متابعة

source: Pick City
ar: اختر مدينة

source: Home
ar: رئيسية

source: Discover
ar: استكشف

source: Categories
ar: تصنيفات

source: Profile
ar: حساب

source: Reset Account
ar: استعادة الحساب

source: An email was sent successfully to your account
ar: تم ارسال بريد الكتروني بنجاح الى حساب

source: Type your e-mail address and will send you a mail containing the instructions to reset your password
ar: اكتب بريدك الالكتروني وستصل رسالة تتضمن خطوات استعادة الحساب

source: Didnt receive email?
ar: لم تقم باستلام رسالة؟

source: Verification code Field is Empty
ar: حقل رقم رمز التحقق خالي

source: Account Verficiation is required.
ar: حقل رمز التحقق مطلوب

source: Verification Code
ar: رمز التحقق

source: An Sms was sent to your phone number containing the code
ar: تم ارسال رسالة قصيرة الى هاتفك تتضمن رمز التحقق

# verificationLoadingMessage
source: Please wait while trying to verify your account.
ar: الرجاء الانتظار بينما يتم التحقق من حسابك

source: Submit
ar: ارسال

source: Account Verified Successfully.
ar: تم التحقق من الحساب بنجاح

source: Session Expired, log in again
ar: انتهت الجلسة الحالية, قم بتسجيل الدخول مرة اخرى

source: Phone Number
ar: رقم الهاتف

source: Account Creation
ar: انشاء حساب

# createAccountLoadingMessage
source: "Please wait while creating account."
ar: الرجاء الانتظار بينما يتم انشاء حسابك

# usernameFieldHint
source: Username
ar: اسم المستخدم

source: Phone Number field can not be empty
ar: حقل رقم الهاتف لا يمكن ان يكون خالي

source: Username field can not be empty
ar: حقل اسم المستخدم لا يمكن ان يكون خالي

source: Email field can not be empty
ar: حقل البريد الالكتروني لا يمكن ان يكون خالي

source: Email field is invalid
ar: البريد الالكتروني غير صالح

source: Contact Email Address
ar: البريد الالكتروني للتواصل

source: Facebook Username
ar: حساب فيسبوك

source: Instagram Username
ar: حساب انستغرام

source: Select the ad location first.
ar: قم باختيار موقع الاعلان

source: Password field can not be empty
ar: حقل كلمة المرور لا يمكن ان يكون خالي

source: Forgot Password?
ar: هل نسيت كلمة المرور؟

source: Continue as guest
ar: المتابعة ك زائر

source: Create account
ar: انشاء حساب

source: About us
ar: عن المنصة

source: Get Help
ar: اطلب المساعدة

# appVersion
source: Version {version}
ar: النسخة {version}

# passwordFieldHint
source: Password
ar: كلمة المرور

# loginScreenName
source: Login
ar: تسجيل الدخول

source: Forget Password
ar: نسيت كلمه المرور ؟

source: Privacy
ar: الخصوصية

source: Notifications
ar: الاشعارات

source: Term of Service
ar: شروط الخدمة

source: Error Occurred
ar: حصل خطا

source: Address Field can not be empty
ar: حقل العنوان لا يمكن ان خالي

source: Address
ar: العنوان

source: Logged out successfully
ar: تم تسجيل الخروج بنجاح

source: Password Changed successfully, login again.
ar: تم تغيير كلمة المرور بنجاح, قم بستجيل الدخول من جديد

source: Full Name
ar: الاسم كامل

source: Country
ar: البلد

source: City
ar: المدينة

source: Gender
ar: الجنس

source: Password can not be less than 6 characters
ar: كلمة المرور لا يمكن ان تكون اقل من ٦ حروف

source: Full name field is required.
ar: حقل الاسم كامل لا يمكن ان يكون خالي

source: Name field can not be empty
ar: الاسم لا يمكن ان يكون خالي

source: Invalid Credentials
ar: معلومات خاطئة

source: Check your password/username first then try again.
ar: تحقق من كلمة المرور او اسم المستخدم ثم حاول مجددا

source: Didnt receive verification?
ar: لم تقم باستلام رمز التحقق؟

source: Reset Message was sent successfully
ar: تم ارسال الرسالة بنجاح

source: We sent a message to
ar: لقد تم ارسال رسالة الى

source: containing
ar: تتضمن

source: digit code write it below to verify that its you.
ar: خانات , اكتبه في المكان المخصص للتحقق

source: Use Phone number
ar: استخدم رقم الهاتف

source: Use Email address
ar: استخدم البريد الالكتروني

source: To Reset your account you can use Phone number or E-mail address associated with the account.
ar: لاستعادة الحساب يمكنك استخدام رقم هاتفك او البريد الالكتروني المرتبط بالحساب

source: Type your Phone number and will send you a sms message containing the instructions to reset your account.
ar: قم بكتابة رقم هاتفك وستصلك رسالة نصية قصيرة تتضمن طريقة استعادة الحساب

source: Type your Email Address and will send you an Email message containing the instructions to reset your account.
ar: قم بكتابة رقم بريدك الالكتروني وستصلك رسالة نصية قصيرة تتضمن طريقة استعادة الحساب

source: Sort Search Result
ar: ترتيب نتائج البحث

source: Search
ar: بحث

source: Name - Ascending
ar: الاسم - تصاعديا

source: Name - Descending
ar: الاسم تنازليا

source: Price - Ascending
ar: السعر - تصاعديا

source: Price - Descending
ar: السعر - تنازليا

source: Discount - Ascending
ar: التخفيض - تصاعديا

source: Discount - Descending
ar: التخفيض - تنازليا

source: Sort
ar: ترتيب

source: Filter by City
ar: فرز حسب المدينة

source: Name
ar: الاسم

source: Price
ar: السعر

source: Discount
ar: التخفيض

source: Recent Ads
ar: الاعلانات الجديدة

source: Edit Profile
ar: تعديل الملف الشخصي

source: Settings
ar: الاعدادات

source: Capture Image
ar: التقط صورة

source: Pick Image from gallery
ar: اختر صورة من معرض الصور

source: Select A method to add avatar
ar: قم طريقة لاختيار صورتك الشخصية

source: Update Profile Avatar
ar: تعديل الصورة الشخصية

source: Personal Information
ar: معلومات الشخصية

source: Not added
ar: غير متوفر

source: Male
ar: ذكر

source: Female
ar: انثى

source: Location
ar: الموقع

source: Account Information
ar: معلومات الحساب

source: Account Security
ar: امان الحساب

source: Chnage Password
ar: تغيير كلمة المرور

source: Update
ar: تحديث

source: this proccess Requires you to relogin after chaning.
ar: هذه العملية تتطلب اعادة تسجيل الدخول

source: Failed to update Profile, try again
ar: فشل تعديل الملف الشخصي, حاول مجددا

source: Update Account Information
ar: تعديل المعلومات الشخصية

source: Update Password
ar: تعديل كلمة المرور

source: New password Field is required.
ar: حقل كلمة المرور الجديدة مطلوب

source: New Password confirmation is required.
ar: حقل تحقق من كلمة المرور الجديدة مطلوب

source: Password Mismatch
ar: كلمة المرور غير متطابقة

source: New Password
ar: كلمة المرور الجديدة

source: Confirm New Password
ar: تاكيد كلمة المرور

source: Type old password for safity measurement
ar: اكتب كلمة المرور الحالية

source: Current Password
ar: كلمة المرور الحالية

source: Update Personal Information
ar: تعديل المعلومات الشخصية

source: Select gender first
ar: اختر الجنس اولا

source: No Data found at the moment.
ar: لا يوجد بيانات في هذه اللحظة

source: My Ads
ar: اعلاناتي

source: Favorite Ads
ar: الاعلانات المفضلة

source: Select brand
ar: اختر العلامة التجارية

source: Attributes
ar: خصائص

source: Failed to post comment
ar: فشل نشر تعليق

source: Write a you comment here
ar: اكتب تعليقك هنا

source: POST
ar: نشر

source: Report
ar: تبليغ

source: Save
ar: تفضيل

source: Share
ar: مشاركة

source: Phone number is not avaiable for This Ad
ar: رقم الهاتف غير متوفر لهذا الاعلان

source: Location for this Ad is not avaliable
ar: الموقع غير متوفر لهذا الاعلان

# discountPercentage
source: {discount}% OFF
ar: {discount}% تخفيض

source: Featured Categories
ar: التصنيفات المميزة

source: Retry
ar: اعادة المحاولة

source: Failed to load Data
ar: فشل تحميل البيانات

source: See more
ar: عرض المزيد

source: Gender field is required
ar: حقل الجنس مطلوب

source: Already Have an Account?
ar: لديك حساب بالفعل؟

source: You are using guest account, login or create account to view this page
ar: انت تستخدم حساب زائر, قم بتسجيل الدخول او انشاء حساب لرؤية المحتوى

source: Select Country First
ar: اختر المدينة اولا

source: Discard data?
ar: تجاهل البيانات؟

source: Are you sure?
ar: هل انت واثق؟

source: Title field is empty
ar: حقل العنوان خالي

source: Add Title for your ad
ar: اضف عنوان لاعلانك

source: Ad Title
ar: عنوان الاعلان

source: Details field can not be empty
ar: حقل تفاصيل الاعلان خالي

source: Descripition of the Ad
ar: وصف الاعلان

source: Ad Details
ar: تفاصيل الاعلان

source: Next
ar: التالي

source: Ad Location & Conatct
ar: موقع الاعلان والتواصل

source: Location Selected
ar: تم اختيار الموقع

source: Contact Phone Number
ar: رقم هاتف التواصل

source: Select Ad Type
ar: اختر نوع الاعلان

source: Wholesale
ar: جملة

source: Normal
ar: فردي

source: Select
ar: اختر

source: if you have only one product you want to offer.
ar: اذا كان لديك منتج واحد تريد عرضه

source: if you have more than one product you want to offer.
ar: اذا كان لديك اكثر من منتج واحد تريد عرضه

source: Ad products
ar: منتجات الاعلان

source: No product added Tap on ➕ icon to add product
ar: لم تتم اضافة منتجات, اضغط على ➕ لاضافة منتج

source: Tap to add product
ar: اضغط لاضافة منتج

source: Edit
ar: تعديل

source: Add product
ar: اضافة منتج

source: Product Images/Videos
ar: صور وفيدوهات المنتج

source: Product name Can not be Empty
ar: اسم المنتج لا يمكن ان يكون خالي

source: Product name
ar: اسم المنتج

source: quantity Can not be Empty
ar: حقل الكمية لا يمكن ان يكون خالي

source: Old price can not be Empty
ar: السعر القديم لا يمكن ان يكون خالي

source: Old Price
ar: السعر القديم

source: New Price Can not be Empty
ar: حقل السعر الجديد لا يمكن ان يكون خالي

source: New Price
ar: السعر الجديد

source: Keyword field Can not be Empty
ar: حقل الكلمات المفتاحية لا يمكن ان يكون خالي

source: Keyword to make your Ad easier to search
ar: الكلمات المفتاحية تجعل اعلانك اسهل في البحث

source: ie: Smartphone,Android,Tv..etc
ar: كمثال: هاتف ذكي, تلفاز, اندرويد... الخ

source: Keyword
ar: الكلمات المفتاحية

source: Select Category
ar: اختر التصنيف

source: Select Attributes
ar: اختر الخصائص

source: more details about the Product
ar: تفاصيل اكثر عن المنتج

source: Product Details
ar: تفاصيل المنتج

source: New price field can not be more than old price field
ar: السعر القديم لا يمكن ان يكون اكثر من السعر الجديد

source: New price can not be equal old price
ar: السعر القديم لا يمكن ان يساوي السعر الجديد

source: Attributes can not be empty
ar: الخصائص لا يمكن ان تكون خالية

source: Select atleast 1 Video/Image
ar: قم باختيار فيديو او صورة واحده على الاقل

source: Review your Ad
ar: مراجعة الاعلان

source: AD submitted successfully.
ar: تم ارسال الاعلان بنجاح

source: You will be notifed once the AD is approved.
ar: سوف يصلك اشعار اذا تم الموافقة على الاعلان

source: Posting product failed, try again
ar: فشل ارسال المنتجات, حاول مجددا

source: Pick Location
ar: اختر موقع

source: Select Current Location
ar: اختر الموقع الحالي

source: Replay
ar: رد

source: Pending
ar: معلق

source: Rejected
ar: مرفوض

source: Approved
ar: مقبول

source: Wholesale ad
ar: اعلان جملة

source: Normal ad
ar: اعلان فردي

source: Active
ar: نشط

source: Status
ar: الحالة

source: Enable
ar: تفعيل

source: Disable
ar: تعطيل

source: Inactive
ar: غير نشط

source: Max media upload is 4
ar: الحد الاعلى للصور او الفيديوهات هو ٤

source: Select Media to add to the uploads
ar: اختر صوؤة او فيديو ليتم رفعها

source: Capture Video
ar: صور فيديو

source: Failed to select video, try again
ar: فشل اختيار الفيديو. حاول مجددا

source: No Media selected. tap on the 📷 icon to add.
ar: لم يتم اختيار صور او فيدوهات, اضغط على زر 📷 للاضافة

source: Max Media uploads for this ad is 4 photos/videos. For videos max is length is 20 seconds
ar: الحد الاقصى للصور او الفيديوهات هو ٤ . الطول الاقصى للفيديو هو ٢٠ ثانية

source: Optimizing video for faster upload time...
ar: جاري تقليل حجم الفيديو لتسهيل الارسال

source: Failed to Optimize video, Try again
ar: فشل عملية تقليل حجم الفيديو. حاول مجددا

source: No Comments added, be the first to comment
ar: لم تتم اضافة تعليقات, كن الاول

source: Save as Draft
ar: حفظ كمسودة

source: Change language
ar: تغيير اللغة

source: Arabic
ar: العربية

source: English
ar: انجليزي

source: Twitter account
ar: حساب تويتر

source: Snapchat account
ar: حساب سنابشات

source: Crop your image
ar: قص الصورة الشخصية

source: Crop
ar: قص

source: Several products
ar: بضائع متنوعة

source: Single product
ar: بضاعة واحده
